FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_EMAC.c
typedef struct {
    const HAL_EMAC *iHAL;
    T_EMACSettings iSettings;
    TUInt16 *rptr;
    TUInt16 *tptr;
    struct ei_device le0;
    ethfifo *iCurrent;
    TUInt16 iFrameByteSize;
    TUInt16 iFrameByteIndex;
    TUInt16 iCurrentByteIndex;
    TUInt16 iCurrentByteSize;
} T_RX63N_EMAC_Workspace;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
extern const HAL_EMAC EMAC_RX63N_Interface;

/**
 * Pragma definitions for receive and transmit packet
 * descriptors
 */
#pragma section  _RX_DESC
static ethfifo rxdesc[ENTRY]; /* receive packet descriptor */
#pragma section  _TX_DESC
static ethfifo txdesc[ENTRY]; /* transmit packet descriptor */
#pragma section

// TODO: The BUFSIZE must match what?  lwIP's variable?

/**
 * Pragma definitions for receive and transmitbuffers managed by
 * the descriptors
 */
#pragma section  _RX_BUFF
static TUInt8 rxbuf[ENTRY][BUFSIZE]; /* receive data buffer */
#pragma section  _TX_BUFF
static TUInt8 txbuf[ENTRY][BUFSIZE]; /* transmit data buffer */
#pragma section

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/

/**
 * Internal functions
 */
#if DEBUG_RX63N_EMAC_RX_DESC
static void IOutputDescriptors(T_RX63N_EMAC_Workspace *p);
#endif

/******************************************************************************
 * Function Name: _phy_mii_write_1
 * Description  : Outputs 1 to the MII interface
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void _phy_mii_write_1(void)
{
    TUInt32 j;

    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000006;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000007;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000007;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000006;
    }
}
/*
static void _phy_mii_write_1_old(void)
{
    TUInt32 j;

    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000007;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000006;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000006;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000007;
    }
}
*/
/******************************************************************************
 * Function Name: _phy_mii_write_0
 * Description  : Outputs 0 to the MII interface
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void _phy_mii_write_0(void)
{
    TUInt32 j;

    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000002;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000003;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000003;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000002;
    }
}
/*
static void _phy_mii_write_0_old(void)
{
    TUInt32 j;

    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000003;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000002;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000002;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000003;
    }
}
*/
/******************************************************************************
 * Function Name: _phy_preamble
 * Description  : As preliminary preparation for access to the PHY module register,
 *                "1" is output via the MII management interface.
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void _phy_preamble(void)
{
    TUInt16 i;

    for (i = 32; i; i--)
        _phy_mii_write_1();
}

/******************************************************************************
 * Function Name: _phy_ta_10
 * Description  : Switches data bus so MII interface can drive data
 *              : for write operation
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void _phy_ta_10(void)
{
    _phy_mii_write_1();
    _phy_mii_write_0();
}

/******************************************************************************
 * Function Name: _phy_ta_z0
 * Description  : Performs bus release so that PHY can drive data
 *              : for read operation
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void _phy_ta_z0(void)
{
    TUInt32 j;

    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000000;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000001;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000001;
    }
    for (j = MDC_WAIT; j > 0; j--) {
        ETHERC.PIR.LONG = 0x00000000;
    }
}

/******************************************************************************
 * Function Name: _phy_reg_set
 * Description  : Sets a PHY device to read or write mode
 * Arguments    : reg_addr - address of the PHY register
 *              : option - mode
 * Return Value : none
 ******************************************************************************/
static void _phy_reg_set(TUInt16 phy_addr, TUInt16 reg_addr, TUInt32 option)
{
    TUInt32 i;
    TUInt16 data;

    // Setup a data register of 14 bits (we've already don the turn around
    // bits) in the upper 14 bits of this 16 bit field.
    data = 0;

    // Setup ST code
    data = (PHY_ST << 14);

    if (option == PHY_READ) {
        // Add in OP Code (RD=Read)
        data |= (PHY_READ << 12);
    } else {
        // Add in OP Code (WT=Write)
        data |= (PHY_WRITE << 12);
    }

    // Put in the PHY address
    data |= (phy_addr << 7);

    // And the Register address
    data |= (reg_addr << 2);

    // Now send out the 14-bits of data
    i = 14;
    while (i) {
        if ((data & 0x8000) == 0) {
            _phy_mii_write_0();
        } else {
            _phy_mii_write_1();
        }
        data <<= 1;
        i--;
    }
}

