FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_EMAC.c
/******************************************************************************
 * Function Name: _eth_fifoWrite
 * Description  : Transmits data and updates E-DMAC descriptor
 * Arguments    : p - pointer to descriptor
 *              : buf - pointer to data to transmit
 *              : size - number of data bytes
 * Return Value : Number of bytes written to transmit buffer for this descriptor
 *              : -1 Descriptor busy
 ******************************************************************************/
TInt32 _eth_fifoWrite(ethfifo *p, TUInt8 buf[], TUInt32 size)
{
    TInt32 i;
    ethfifo *current = p;

    if ((current->status & ACT) != 0) {
        /**
         * Current descriptor is active and ready to transmit or transmitting.
         **/
        return (-1);
    }

    for (i = 0; i < size; i++) {
        if (i >= BUFSIZE) {
            break;
        } else {
            /* transfer packet data */
            current->buf_p[i] = buf[i];
        }
    }

    current->bufsize = (TUInt16)i;

    return (i);

}

#if 0
/******************************************************************************
 * Function Name: _eth_fifoRead
 * Description  : Receives data and updates E-DMAC descriptor
 * Arguments    : p - pointer to descriptor
 *              : buf - pointer to data to receive
 * Return Value : Number of bytes received for this descriptor
 *              : -1 Descriptor busy
 *              : -2 Frame error
 ******************************************************************************/
TUInt32 _eth_fifoRead(ethfifo *p, TUInt8 buf[])
{
    TUInt32 i, temp_size; /* byte counter */
    ethfifo *current = p;

    if ((current->status & ACT) != 0) {
        /**
         * Current descriptor is active and ready to receive or receiving.
         * This is not an error.
         **/
        return (-1);
    }

    /**
     * Current descriptor is not active.
     * Process the descriptor and data received.
     **/
    else if ((current->status & FE) != 0) {
        /**
         * Frame error.
         * Must move to new descriptor as E-DMAC now points to next one.
         **/
        return (-2);
    } else
    /* We have a new data w/o errors to process. */
    {
        if ((current->status & FP0) == FP0) {
            /* This is the last descriptor.  Complete frame is received.   */
            temp_size = current->size;

            while (temp_size > BUFSIZE) {
                temp_size -= BUFSIZE;
            }
        } else {
            /**
             * This is either a start or continuos descriptor.
             * Complete frame is NOT received.
             **/
            temp_size = BUFSIZE;
        }

        /* Copy received data from receive buffer to user buffer */
        for (i = 0; i < temp_size; i++) {
            buf[i] = current->buf_p[i];
        }

        /* Return data size received */
        return (temp_size);
    }
}
#endif

/*---------------------------------------------------------------------------*
 * Routine:  IPHYWrite
 *---------------------------------------------------------------------------*
 * Description:
 *      Write the register in the given PHY to the given value.
 * Inputs:
 *      T_RX63N_EMAC_Workspace *p -- EMAC's Workspace
 *      TUInt32 aPhyReg             -- PHY register to write
 *      TUInt32 aValue              -- Value to write to register
 *---------------------------------------------------------------------------*/
static void IPHYWrite(T_RX63N_EMAC_Workspace *p, TUInt8 PhyReg, TUInt32 Value)
{
#if 0
    TUInt32 timeout;

    // Write the PHY's register with the value
    MADR = p->iSettings.iPHYAddr | PhyReg;
    MWTD = Value;

    // Wait utill operation completed
    for (timeout = 0; timeout < MII_WR_TOUT; timeout++) {
        if ((MIND & MIND_BUSY) == 0) {
            break;
        }
    }
#endif
    _phy_write(p->iSettings.iPHYAddr, PhyReg, Value);
}

/*---------------------------------------------------------------------------*
 * Routine:  IPHYRead
 *---------------------------------------------------------------------------*
 * Description:
 *      Read the register from the given PHY.
 * Inputs:
 *      T_RX63N_EMAC_Workspace *p -- EMAC's Workspace
 *      TUInt32 aPhyReg             -- PHY register to write
 *      TUInt32 aValue              -- Value to write to register
 *---------------------------------------------------------------------------*/
static TUInt16 IPHYRead(T_RX63N_EMAC_Workspace *p, TUInt8 PhyReg)
{
    return _phy_read(p->iSettings.iPHYAddr, PhyReg);
}

/*---------------------------------------------------------------------------*
 * Routine:  IEMACConfigPHY_National
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure for the National PHY
 * Inputs:
 *      T_RX63N_EMAC_Workspace *p -- EMAC's Workspace
 *---------------------------------------------------------------------------*/
static T_uezError IEMACConfigPHY_National(T_RX63N_EMAC_Workspace *p)
{
    T_uezError error = UEZ_ERROR_NONE;
    TUInt32 timeout, regv;

    // Force ON Auto-MDIX
    IPHYWrite(p, PHY_REG_PHYCR, IPHYRead(p, PHY_REG_PHYCR) | (1 << 15));

    // auto negotiation, restart AN
    // RE_AN should be self cleared
    IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);

    // Wait to complete Auto_Negotiation.
    for (timeout = 0; timeout < 10; timeout++) {
        UEZBSPDelayMS(100);
        regv = IPHYRead(p, PHY_REG_BMSR);
        if (regv & 0x0020) {
            // Autonegotiation Complete.
            break;
        }
    }

    // Check the link status.
    if (error == UEZ_ERROR_NONE) {
        error = UEZ_ERROR_TIMEOUT;
        for (timeout = 0; timeout < 10; timeout++) {
            UEZBSPDelayMS(100);
            regv = IPHYRead(p, PHY_REG_STS);
            if (regv & 0x0001) {
                // Link is on.
                error = UEZ_ERROR_NONE;
                break;
            }
        }
    }

    if (error == UEZ_ERROR_NONE) {
        // Configure Full/Half Duplex mode.
        if (regv & 0x0004) {
            // Full duplex is enabled.
            ETHERC.ECMR.BIT.DM = 1;
        } else {
            // Half duplex mode.
            ETHERC.ECMR.BIT.DM = 0;
        }

        // RMII: Configure 100MBit/10MBit mode.
        if (regv & 0x0002) {
            // 10MBit mode.
            ETHERC.ECMR.BIT.RTM = 0;
        } else {
            // 100MBit mode.
            ETHERC.ECMR.BIT.RTM = 1;
        }

