FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_EMAC.c
        /* Enable receive and transmit */
        ETHERC.ECMR.BIT.RE = 1;
        ETHERC.ECMR.BIT.TE = 1;

        /* Enable EDMAC receive */
        EDMAC.EDRRR.LONG = 0x00000001;
        UEZBSPDelayMS(100);
    }

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IEMACConfigPHY_NationalDSP83640
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure for the National PHY
 * Inputs:
 *      T_RX63N_EMAC_Workspace *p -- EMAC's Workspace
 *---------------------------------------------------------------------------*/
static T_uezError IEMACConfigPHY_NationalDSP83640(T_RX63N_EMAC_Workspace *p)
{
    T_uezError error = UEZ_ERROR_NONE;
    TUInt32 timeout, regv;

    // Force ON Auto-MDIX
    //IPHYWrite(p, PHY_REG_PHYCR, IPHYRead(p, PHY_REG_PHYCR) | (1 << 15));
    IPHYWrite(p, AN_ADVERTISEMENT_REG, 0x01E1);
    IPHYWrite(p, BASIC_MODE_CONTROL_REG, 0x1200);


    // auto negotiation, restart AN
    // RE_AN should be self cleared
    IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);

    // Wait to complete Auto_Negotiation.
    for (timeout = 0; timeout < 1000; timeout++) {
        UEZBSPDelayMS(1);
        regv = IPHYRead(p, PHY_REG_BMSR);
        if (regv & 0x0020) {
            // Autonegotiation Complete.
            break;
        }
    }

    /* National DP83640 fix */
    IPHYWrite(p, 0x13, 0x0006);
    IPHYWrite(p, 0x14, (IPHYRead(p, 0x14)&0x7FFF));
    IPHYWrite(p, 0x13, 0x0000);

    /* Get the link partner response */
    //reg = (int16_t)_phy_read(AN_LINK_PARTNER_ABILITY_REG);

    // Check the link status.
    if (error == UEZ_ERROR_NONE) {
        error = UEZ_ERROR_TIMEOUT;
        for (timeout = 0; timeout < 1000; timeout++) {
            UEZBSPDelayMS(10);
            regv = IPHYRead(p, PHY_REG_STS);
            if (regv & 0x0001) {
                // Link is on.
                error = UEZ_ERROR_NONE;
                break;
            }
        }
    }

    if (error == UEZ_ERROR_NONE) {
        // Configure Full/Half Duplex mode.
        if (regv & 0x0004) {
            // Full duplex is enabled.
            ETHERC.ECMR.BIT.DM = 1;
        } else {
            // Half duplex mode.
            ETHERC.ECMR.BIT.DM = 0;
        }

        // RMII: Configure 100MBit/10MBit mode.
        if (regv & 0x0002) {
            // 10MBit mode.
            ETHERC.ECMR.BIT.RTM = 0;
        } else {
            // 100MBit mode.
            ETHERC.ECMR.BIT.RTM = 1;
        }

        /* Enable receive and transmit */
        ETHERC.ECMR.BIT.RE = 1;
        ETHERC.ECMR.BIT.TE = 1;

        /* Enable EDMAC receive */
        EDMAC.EDRRR.LONG = 0x00000001;
        UEZBSPDelayMS(100);
    }

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IEMACConfigPHY_Micrel
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure for the Micrel PHY
 * Inputs:
 *      T_RX63N_EMAC_Workspace *p -- EMAC's Workspace
 *---------------------------------------------------------------------------*/
static T_uezError IEMACConfigPHY_Micrel(T_RX63N_EMAC_Workspace *p)
{
    T_uezError error = UEZ_ERROR_NONE;
    TUInt32 timeout, regv;
#if DEBUG_RX63N_EMAC_STARTUP
    TUInt32 reg;
#endif
    // auto negotiation, restart AN
    // RE_AN should be self cleared
    IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);

    // Wait to complete Auto_Negotiation.
    for (timeout = 0; timeout < 30; timeout++) {
#if DEBUG_RX63N_EMAC_STARTUP
        printf(".");
#endif
        UEZBSPDelayMS(100);
        regv = IPHYRead(p, PHY_REG_BMSR);
        if (regv & (BMSR_AUTO_DONE | BMSR_LINK_ESTABLISHED)) {
            // Autonegotiation Complete.
            break;
        }
    }

    regv = IPHYRead(p, MIC_PHY_100BASE_PHY_CTRL);
#if DEBUG_RX63N_EMAC_STARTUP
    printf("nego regv %04X\n", regv);
#endif
    // successful negotiations; update link info
    regv &= 0x001C;
    switch (regv) {
        case 0x0004:
            // Half duplex mode.
            ETHERC.ECMR.BIT.DM = 0;
            // 10MBit mode.
            ETHERC.ECMR.BIT.RTM = 0;
            break;
        case 0x0008:
            // Half duplex mode.
            ETHERC.ECMR.BIT.DM = 0;
            // 100MBit mode.
            ETHERC.ECMR.BIT.RTM = 1;
            break;
        case 0x0014:
            // Full duplex is enabled.
            ETHERC.ECMR.BIT.DM = 1;
            // 10MBit mode.
            ETHERC.ECMR.BIT.RTM = 0;
            break;
        case 0x0018:
            // Full duplex is enabled.
            ETHERC.ECMR.BIT.DM = 1;
            // 100MBit mode.
            ETHERC.ECMR.BIT.RTM = 1;
            break;
        default: // Should not come here, force to set default, 100 FULL_DUPLEX
            // Full duplex is enabled.
            ETHERC.ECMR.BIT.DM = 1;
            // 100MBit mode.
            ETHERC.ECMR.BIT.RTM = 1;
            break;
    }

#if DEBUG_RX63N_EMAC_STARTUP
    for (reg = 0; reg < 32; reg++) {
        regv = IPHYRead(p, reg);
        printf("phyreg %d = %04X\n", reg, regv);
    }
#endif

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_EMAC_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the workspace for this EMAC Controller
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_EMAC_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_EMAC_Workspace *p = (T_RX63N_EMAC_Workspace *)aWorkspace;

    // Setup a brand new le0 ethdriver
    memset(&p->le0, 0, sizeof(p->le0));
    p->le0.name = "eth0";

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_EMAC_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure and setup the EMAC screen with the given settings
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *      T_EMACSettings *aSettings -- Pointer to settings to use
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_EMAC_Configure(void *aWorkspace, T_EMACSettings *aSettings)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_RX63N_EMAC_Workspace *p = (T_RX63N_EMAC_Workspace *)aWorkspace;
    TUInt32 regv, timeout;
    TUInt32 retry;
    //TUInt32 addr = 1;
    static TUInt32 uniqueID;
    TUInt32 i;
    TUInt32 mac_h, mac_l;
    // TUInt16 phydata;
    TUInt16 addr;
    TUInt16 v;

