FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_EMAC.c
#if DEBUG_RX63N_EMAC_RX_DESC
    IOutputDescriptors(p);
    printf("CopyFromFrame: size: %d\n", aSize);
    printf("  index: %d, size: %d\n", p->iCurrentByteIndex, p->iCurrentByteSize);
    printf("  findex: %d, fsize: %d\n", p->iFrameByteIndex, p->iFrameByteSize);
#endif
    while (isCopying) {
        // Is this block ready?  If not, wait for up to 5 ms
        timeout = 5;
        while (((p->iCurrent->status & ACT) != 0) && (timeout--)) {
            // NOTE: This delay sucks!  We should remove this
            // with an interrupt driven way later.
            UEZBSPDelayMS(1);
        }
        // Abort if the timeout failed
        if (timeout == 0)
            break;

        // Copy over a byte
        *(p_dest++) = p->iCurrent->buf_p[p->iCurrentByteIndex++];
        p->iFrameByteIndex++;
        if ((p->iCurrentByteIndex >= p->iCurrentByteSize)
                || (p->iFrameByteIndex >= p->iFrameByteSize)) {
            // If we have reached the end of this descriptor's block OR we have
            // just plain reached the end of the frame, move to the next
            // descriptor block.

            // Was this the end?
            if ((p->iCurrent->status & FP0) == FP0) {
                p->le0.stat.rx_packets++;
                isCopying = EFalse;
#if DEBUG_RX63N_EMAC_RX_DESC
                printf("--End frame\n");
#endif
                } else {
                // More data to go, setup the length again
                p->iCurrentByteIndex = 0;
                p->iCurrentByteSize = BUFSIZE;
#if DEBUG_RX63N_EMAC_RX_DESC
                printf("--End desc\n");
#endif
                }

            // Clear the flags for start/end and set to active again
            p->le0.rxcurrent->status &= ~(FP1 | FP0);
            p->le0.rxcurrent->status |= ACT;
            // Next block please
            p->iCurrent = p->le0.rxcurrent = p->le0.rxcurrent->next;

            // Restart EDMAC if stopped
            if (EDMAC.EDRRR.LONG == 0x00000000L) {
                /* Restart if stopped */
                EDMAC.EDRRR.LONG = 0x00000001L;
            }
        }
        // Decrement the number of bytes needed.
        // Regardless of the above, if we got all the bytes we
        // wanted, stop looping here.
        aSize--;
        if (aSize == 0)
            break;
    }
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_EMAC RX63N_EMAC_Interface = {
        "RX63N:EMAC",
        0x0100,
        RX63N_EMAC_InitializeWorkspace,
        sizeof(T_RX63N_EMAC_Workspace),

        RX63N_EMAC_Configure,
        RX63N_EMAC_CheckFrameReceived,
        RX63N_EMAC_StartReadFrame,
        RX63N_EMAC_EndReadFrame,
        RX63N_EMAC_RequestSend,
        RX63N_EMAC_DoSend,
        RX63N_EMAC_CopyToFrame,
        RX63N_EMAC_CopyFromFrame,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void RX63N_100_EMAC_RMII_Require()
{	
	static const T_RX63N_MPC_ConfigList pins[] = {
		{GPIO_PA5, 0x11},	// ET_LINKSTA
		{GPIO_PA3, 0x11},	// ET_MDIO
		{GPIO_PA4, 0x11},	// ET_MDC
		{GPIO_PB0, 0x12},	// RMII_RXD1
		{GPIO_PB1, 0x12},	// RMII_RXD0
		{GPIO_PB2, 0x12},	// REF50CK
		{GPIO_PB3, 0x12},	// RMII_RX_ER
		{GPIO_PB4, 0x12},	// RMII_TXD_EN
		{GPIO_PB5, 0x12},	// RMII_TXD0
		{GPIO_PB6, 0x12},	// RMII_TXD1
		{GPIO_PB7, 0x12},	// RMII_CRS_DV
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("EMAC", (T_halInterface *)&RX63N_EMAC_Interface, 0, 0);

	RX63N_MPC_ConfigAllPins(pins, ARRAY_COUNT(pins));
}

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void RX63N_176_EMAC_RMII_Require()
{
	static const T_RX63N_MPC_ConfigList pins[] = {
		{GPIO_P54, 0x11},	// ET_LINKSTA
		{GPIO_P71, 0x11},	// ET_MDIO
		{GPIO_P72, 0x11},	// ET_MDC
		{GPIO_P74, 0x12},	// RMII_RXD1
		{GPIO_P75, 0x12},	// RMII_RXD0
		{GPIO_P76, 0x12},	// REF50CK
		{GPIO_P77, 0x12},	// RMII_RX_ER
		{GPIO_P80, 0x12},	// RMII_TXD_EN
		{GPIO_P81, 0x12},	// RMII_TXD0
		{GPIO_P82, 0x12},	// RMII_TXD1
		{GPIO_PB7, 0x12},	// RMII_CRS_DV
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("EMAC", (T_halInterface *)&RX63N_EMAC_Interface, 0, 0);

	RX63N_MPC_ConfigAllPins(pins, ARRAY_COUNT(pins));
}

/*-------------------------------------------------------------------------*
 * End of File:  EMAC.c
 *-------------------------------------------------------------------------*/
